test/http_recordings/charge_with_card_token.json

[
  {
    "request": {
      "body": "{\"token\":null,\"number\":\"5520000000000000\",\"name\":\"Rubius Hagrid\",\"expiry_year\":\"20\",\"expiry_month\":\"12\",\"cvc\":\"321\",\"address_state\":null,\"address_postcode\":null,\"address_line2\":null,\"address_line1\":\"The Game Keepers Cottage\",\"address_country\":\"England\",\"address_city\":\"Hogwarts\"}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/cards"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":{\"token\":\"card_Fzxe8I8iXxo5OBFdf8G7VA\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"ip_address\":\"103.217.167.81\"}",
      "headers": {
        "Date": "Mon, 21 May 2018 08:25:14 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "399",
        "Connection": "keep-alive",
        "Server": "nginx",
        "X-Requested-From": "103.217.167.81",
        "ETag": "W/\"3b85bf427d8b686756597860b3675d19\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "19b3bd20-7c7f-4cc5-a7a8-52431c0cd82f",
        "X-Runtime": "0.042368",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 201,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "{\"transfer\":null,\"total_fees\":null,\"settlement_currency\":null,\"refund_pending\":null,\"metadata\":null,\"merchant_entitlement\":null,\"ip_address\":\"127.0.0.1\",\"email\":\"hagrid@hogwarts.wiz\",\"description\":\"Dragon eggs\",\"customer_token\":null,\"currency\":null,\"card_token\":\"card_Fzxe8I8iXxo5OBFdf8G7VA\",\"card\":null,\"captured\":null,\"capture\":null,\"authorisation_expired\":null,\"amount_refunded\":null,\"amount\":50000}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/charges"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":{\"token\":\"ch_IAa42eyA-mIHmBhmiLqj6g\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-21T08:25:14Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_Fzxe8I8iXxo5OBFdf8G7VA\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}}}",
      "headers": {
        "Date": "Mon, 21 May 2018 08:25:14 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "820",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"ac368b997cd180e2f533955f4c1c8df8\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "d9581087-3e14-4b28-991b-d1d66d5334df",
        "X-Runtime": "0.254249",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 201,
      "type": "ok"
    }
  }
]