test/http_recordings/charge_with_customer_token.json

[
  {
    "request": {
      "body": "{\"token\":null,\"email\":\"hagrid@hogwarts.wiz\",\"card_token\":null,\"card\":{\"token\":null,\"number\":\"5520000000000000\",\"name\":\"Rubius Hagrid\",\"expiry_year\":\"20\",\"expiry_month\":\"12\",\"cvc\":\"321\",\"address_state\":null,\"address_postcode\":null,\"address_line2\":null,\"address_line1\":\"The Game Keepers Cottage\",\"address_country\":\"England\",\"address_city\":\"Hogwarts\"}}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/customers"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":{\"token\":\"cus_lFkaLkFG4DP1xLss7J5gcQ\",\"email\":\"hagrid@hogwarts.wiz\",\"created_at\":\"2018-05-21T08:41:11Z\",\"card\":{\"token\":\"card_8G1GORVS3RB_lt7r8RCpmw\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":\"cus_lFkaLkFG4DP1xLss7J5gcQ\",\"primary\":true}}}",
      "headers": {
        "Date": "Mon, 21 May 2018 08:41:11 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "505",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"8fb7b6bfe1ce754382412c9216b18117\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "0f5b26d7-85dc-4718-b033-26ace481c2a1",
        "X-Runtime": "0.072207",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 201,
      "type": "ok"
    }
  },
  {
    "request": {
      "body": "{\"transfer\":null,\"total_fees\":null,\"settlement_currency\":null,\"refund_pending\":null,\"metadata\":null,\"merchant_entitlement\":null,\"ip_address\":\"127.0.0.1\",\"email\":\"hagrid@hogwarts.wiz\",\"description\":\"Dragon eggs\",\"customer_token\":\"cus_lFkaLkFG4DP1xLss7J5gcQ\",\"currency\":null,\"card_token\":null,\"card\":null,\"captured\":null,\"capture\":null,\"authorisation_expired\":null,\"amount_refunded\":null,\"amount\":50000}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/charges"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":{\"token\":\"ch_R_1gYFLVshnSuvfXvalpiw\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-21T08:41:11Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_8G1GORVS3RB_lt7r8RCpmw\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":\"cus_lFkaLkFG4DP1xLss7J5gcQ\",\"primary\":true},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}}}",
      "headers": {
        "Date": "Mon, 21 May 2018 08:41:12 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "844",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"da9a06af61befe09e6a10417400d5abe\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "08bf9391-be41-4007-9cd4-900cb1ed27db",
        "X-Runtime": "0.165220",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 201,
      "type": "ok"
    }
  }
]