test/http_recordings/get_all_charges.json

[
  {
    "request": {
      "body": "\"\"",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/charges"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":[{\"token\":\"ch_lHGnMQU16dxHx3XhVIFWow\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-22T08:11:10Z\",\"status_message\":\"Successful Authorisation\",\"error_message\":null,\"card\":{\"token\":\"card_vGq6Vx7zS0rZwkhlNbj5ng\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_oKVC4ucVtWXOJVgDcqsg6Q\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-22T08:09:54Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card__bkRxiFiTTbkkf1ToAkMHg\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_TZ8AmD2Ooys3HgN6vFqDPw\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-22T08:09:31Z\",\"status_message\":\"Successful Authorisation\",\"error_message\":null,\"card\":{\"token\":\"card_z634giU7wvQYug4wXQG0ew\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_FGO8IADMzWXK7PtSM7mO6A\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-21T14:22:08Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_4CToAHDg8FqzrJsh7Iv_jQ\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":\"cus_GRi-xUCRk_R2kchzFR7_lA\",\"primary\":true},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_kpJzZitcLVVBMQ6LX1mmXg\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-21T14:18:32Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_Z7EffSMwqkVq8ooL0U8JDw\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":\"cus_pJPtVAadW0RIUqU-Utd4uQ\",\"primary\":true},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_R_1gYFLVshnSuvfXvalpiw\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-21T08:41:11Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_8G1GORVS3RB_lt7r8RCpmw\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":\"cus_lFkaLkFG4DP1xLss7J5gcQ\",\"primary\":true},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_IAa42eyA-mIHmBhmiLqj6g\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-21T08:25:14Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_Fzxe8I8iXxo5OBFdf8G7VA\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_ZGTqpyHJPHSrLyrJ27CcYw\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-21T08:07:47Z\",\"status_message\":\"Successful Authorisation\",\"error_message\":null,\"card\":{\"token\":\"card_vJiKZQZdECZutoOtEVV3YQ\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_RFsl1M_q0U4rEp2q720JhQ\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-21T07:56:15Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_R6khtY81EZE5RiqkidVhgA\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_OKz1IsP42wojP97NOlFKXw\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-21T07:55:57Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_sA-Lih7lwqYmSk6uHAUWzQ\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_c_PzwzqRe0Reox5pnlI7Dg\",\"success\":true,\"amount\":5000,\"currency\":\"AUD\",\"description\":\"Polyjuice Potion\",\"email\":\"a@a.com\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-04-20T16:13:14Z\",\"status_message\":\"Successful Authorisation\",\"error_message\":null,\"card\":{\"token\":\"card_-7JxmRuP5C9Z-7iwXtFT3A\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":true,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_J3jtgiNC45iXiWT9_xuCgg\",\"success\":true,\"amount\":5000,\"currency\":\"AUD\",\"description\":\"Polyjuice Potion\",\"email\":\"a@a.com\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-04-20T16:08:02Z\",\"status_message\":\"Successful Authorisation\",\"error_message\":null,\"card\":{\"token\":\"card_2rnI4JxHj2Cathla34SCMg\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":true,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_8qBVESZEwdVBMhdl1Cs1XA\",\"success\":true,\"amount\":5000,\"currency\":\"AUD\",\"description\":\"Polyjuice Potion\",\"email\":\"a@a.com\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-04-20T16:05:19Z\",\"status_message\":\"Successful Authorisation\",\"error_message\":null,\"card\":{\"token\":\"card_gfydZT6sq7EQxbEufCJaNg\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":true,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_gOlLBf_mjqk3Dp2NaN4aqw\",\"success\":true,\"amount\":5000,\"currency\":\"AUD\",\"description\":\"Polyjuice Potion\",\"email\":\"a@a.com\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-04-20T15:57:32Z\",\"status_message\":\"Successful Authorisation\",\"error_message\":null,\"card\":{\"token\":\"card_ql7Y0HcSwbzVg_tihXYa4g\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":true,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_4lPBBop9suH_vDcqmJleyQ\",\"success\":true,\"amount\":5000,\"currency\":\"AUD\",\"description\":\"Polyjuice Potion\",\"email\":\"a@a.com\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-04-20T15:54:48Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_7A_USX8Vlfn8_oUlKDbocw\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":180,\"merchant_entitlement\":4820,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_SQG0cSfE3AytQKRVAHMFNg\",\"success\":true,\"amount\":500,\"currency\":\"AUD\",\"description\":\"Dragon Eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2015-11-15T08:33:04Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_i-DSgMjhcwRi_dInriNBTw\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":10,\"expiry_year\":2016,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":\"H0G\",\"address_state\":\"WA\",\"address_country\":\"Straya\",\"customer_token\":\"cus_uie_Z4FA-FWn2hIHfTlHoA\",\"primary\":true},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":45,\"merchant_entitlement\":455,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_NCoA7oBzrycXEPBTEUWNdQ\",\"success\":true,\"amount\":500,\"currency\":\"AUD\",\"description\":\"Dragon Eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2015-11-15T07:51:05Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_i-DSgMjhcwRi_dInriNBTw\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":10,\"expiry_year\":2016,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":\"H0G\",\"address_state\":\"WA\",\"address_country\":\"Straya\",\"customer_token\":\"cus_uie_Z4FA-FWn2hIHfTlHoA\",\"primary\":true},\"transfer\":[],\"amount_refunded\":500,\"total_fees\":45,\"merchant_entitlement\":455,\"refund_pending\":true,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_ELcZNI6P6EH8PBFEQOC-Ag\",\"success\":true,\"amount\":500,\"currency\":\"AUD\",\"description\":\"Dragon Eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2015-11-15T07:47:29Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_i-DSgMjhcwRi_dInriNBTw\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":10,\"expiry_year\":2016,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":\"H0G\",\"address_state\":\"WA\",\"address_country\":\"Straya\",\"customer_token\":\"cus_uie_Z4FA-FWn2hIHfTlHoA\",\"primary\":true},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":45,\"merchant_entitlement\":455,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_Agl7rNdEiCe3TYPKpH5Idw\",\"success\":true,\"amount\":500,\"currency\":\"AUD\",\"description\":\"Dragon Eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2015-11-15T07:22:41Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_5qBju5AwMRBpC8X1v47gSw\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2016,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":\"6000\",\"address_state\":\"WA\",\"address_country\":\"Straya\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":45,\"merchant_entitlement\":455,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_wQWXpjW4wX_RwcU0ZXB7xw\",\"success\":true,\"amount\":5000,\"currency\":\"AUD\",\"description\":\"Dragon Eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2015-11-15T05:02:57Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_PBW43_PLrNeyqJH05gl3hA\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":10,\"expiry_year\":2016,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":\"H0G\",\"address_state\":\"WA\",\"address_country\":\"Straya\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":2000,\"total_fees\":180,\"merchant_entitlement\":4820,\"refund_pending\":true,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_K9xgAZcx_Ki-xFIyVYKASw\",\"success\":true,\"amount\":500,\"currency\":\"AUD\",\"description\":\"Dragon Eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2015-10-28T08:33:35Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_Uls6M7sTzS8PpyK0P8oixA\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":10,\"expiry_year\":2016,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":\"6000\",\"address_state\":\"WA\",\"address_country\":\"Straya\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":500,\"total_fees\":45,\"merchant_entitlement\":455,\"refund_pending\":true,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_KGIRhyKk32cRIQT9xIZLyA\",\"success\":true,\"amount\":500,\"currency\":\"AUD\",\"description\":\"Dragon Eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2015-10-28T08:30:10Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_PTe-DFdVZgci-CmBoUjzcQ\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":10,\"expiry_year\":2016,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":\"6000\",\"address_state\":\"WA\",\"address_country\":\"Straya\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":500,\"total_fees\":45,\"merchant_entitlement\":455,\"refund_pending\":true,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_ImfPyVgDXzIlgaX2TO4xAg\",\"success\":true,\"amount\":500,\"currency\":\"AUD\",\"description\":\"Dragon Eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2015-10-28T08:26:23Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_f7Yo6ckD3hesBIsFS2pQ5g\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":10,\"expiry_year\":2016,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":\"6000\",\"address_state\":\"WA\",\"address_country\":\"Straya\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":500,\"total_fees\":45,\"merchant_entitlement\":455,\"refund_pending\":true,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_JFbX45QT6LVRXUxfu3vKKw\",\"success\":true,\"amount\":500,\"currency\":\"AUD\",\"description\":\"Dragon Eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2015-10-28T08:23:07Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_EvMvq1BXa85kj1p0boSt-A\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":10,\"expiry_year\":2016,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":\"6000\",\"address_state\":\"WA\",\"address_country\":\"Straya\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":500,\"total_fees\":45,\"merchant_entitlement\":455,\"refund_pending\":true,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_Jsb8IdWW0mL7RVQcXVFRdg\",\"success\":true,\"amount\":500,\"currency\":\"AUD\",\"description\":\"Dragon Eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2015-10-28T08:22:31Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_TAXQfbe87nVOQYVp9LVPOw\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":10,\"expiry_year\":2016,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":\"6000\",\"address_state\":\"WA\",\"address_country\":\"Straya\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":500,\"total_fees\":45,\"merchant_entitlement\":455,\"refund_pending\":true,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}}],\"count\":25,\"pagination\":{\"current\":1,\"previous\":null,\"next\":2,\"per_page\":25,\"pages\":3,\"count\":57}}",
      "headers": {
        "Date": "Tue, 22 May 2018 08:21:40 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "20466",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"b8aa7d4c34c2f309968b99d766d1cc4e\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "fb0b7d29-7941-4d1d-83ac-aa85b315b75e",
        "X-Runtime": "0.143838",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]