test/http_recordings/search_charges.json

[
  {
    "request": {
      "body": "\"\"",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "get",
      "options": [],
      "request_body": "",
      "url": "https://test-api.pin.net.au/1/charges/search"
    },
    "response": {
      "binary": false,
      "body": "{\"response\":[{\"token\":\"ch_kde3n7ahjoc2_dXv69nQ3A\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T02:23:58Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_-ZpmrwCE4bQpcE210vpVbw\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":50000,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":true,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_9oTUwSPdIvQhoyciNRTudA\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T02:20:40Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_Tm7-69DVzhBRTr1_EAF9ng\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":50000,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":true,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_vQJZ94oXsA5tZ6_9MOm4Ag\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T02:20:07Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_e4jmUw0Z3APwdybf9swVTQ\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":50000,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":true,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_SfjmafC4Cd5ZkgPHBSOPHQ\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T02:07:01Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_rUm901rxgAgC3FJPkVCU1Q\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":50000,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":true,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_8r4JzlzVQj9aLQJxo6oMng\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T02:06:19Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_zSwnPf7cIlT_VBdzixVHNw\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":50000,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":true,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_NR_Kkm_ZLp7JWNzKgDX6bw\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T01:50:54Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_ZISnopSZtSXf6GDb95K4OA\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":50000,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":true,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_p3AOVuVVQIEf5ZScTl2-zg\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T01:50:19Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_kPmCg01EV2YmwTDmV9IOeA\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_vG6fUKYtXAHaCZ2vfU8UIQ\",\"success\":false,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T00:40:48Z\",\"status_message\":\"An unexpected error has occurred\",\"error_message\":\"An unexpected error has occurred\",\"card\":{\"token\":\"card_HI9a54GV8fWsacRiHfeySQ\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0003\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_XvRmvhRJ48Nu-OpUxn3P8g\",\"success\":false,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T00:39:00Z\",\"status_message\":\"The transaction was flagged as possibly fraudulent and subsequently declined\",\"error_message\":\"The transaction was flagged as possibly fraudulent and subsequently declined\",\"card\":{\"token\":\"card_jwjiNikyoK6WQwjNlUaIFw\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0006\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_vvwrLC2xCPbcFyWxK2vWsQ\",\"success\":false,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T00:38:59Z\",\"status_message\":\"The account has insufficient funds\",\"error_message\":\"The account has insufficient funds\",\"card\":{\"token\":\"card_jCP-rw8X4Vhw_K56lc1yXg\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0002\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_4PaJUjCwFKp6TftAOG1kIw\",\"success\":false,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T00:38:58Z\",\"status_message\":\"Invalid card details\",\"error_message\":\"Invalid card details\",\"card\":{\"token\":\"card_sSukCdf8ER5ANguIp_qGdg\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0004\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_nQQz3XQbRHXshJYTR_UUoQ\",\"success\":false,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T00:38:58Z\",\"status_message\":\"Processing error\",\"error_message\":\"Processing error\",\"card\":{\"token\":\"card_SZUb7RFduRwjDNfuOnzBig\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0005\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_k8qLPuSF9H9pIP6yrGbAFQ\",\"success\":false,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T00:38:56Z\",\"status_message\":\"An unexpected error has occurred\",\"error_message\":\"An unexpected error has occurred\",\"card\":{\"token\":\"card_e5Vq3HK-U6yVA0XO85Dxtg\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0003\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_yC6xjUxyNRLKvbCaavGvlA\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T00:31:30Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_tgXFvsERbqHsHcpxV2gSng\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_2tazr74RE8IvuFMIDc54rA\",\"success\":false,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T00:31:08Z\",\"status_message\":\"Card Declined\",\"error_message\":\"Card Declined\",\"card\":{\"token\":\"card_f-C7k6PElA02YK1B26jV1g\",\"scheme\":\"visa\",\"display_number\":\"XXXX-XXXX-XXXX-0001\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":null,\"merchant_entitlement\":null,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":false,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_wEGGRQ3eTivCsNRgdGbT0w\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T00:14:07Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_ijQ6gpKFqwvL6DB_rzHsBQ\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_IAtu31p9IJF5KZPMu2PTvg\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T00:13:16Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_Qt6KwL6XuA4Gvvj9yq8k5A\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_87PSgsr_TjCWpCUJ9Tuznw\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T00:11:40Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_GDrKxR-fSCluJXQOnhfXfg\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_nmq1AVc6h9vI_Hvc9AonGQ\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T00:11:28Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_zKtz1JPF6fKBK3Duz6ThQA\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_itdd0hIPw44taGw5rXsB-w\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T00:07:59Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_AKVuFZQeuc7q4K-QcEwX2w\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_Fcd8Cdvm28ymyXsqlNPJ_A\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-23T00:07:25Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_NeDNSCHBpQxzSk7yKIt9ag\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_FZmfbhuxjil_dInFWEJMqg\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-22T14:54:10Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_uC7h6RcEbiCOWlHU2KTCRg\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_DCtLzJPxHocRQ-8gAUtV-A\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-22T14:53:04Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_id5UnpRB4m46o6Td2T9e4Q\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_wnWMo42SB5oLwk6BqxwCyA\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-22T14:52:53Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_4O0n9eNnMKZUKrw5v8kWJg\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}},{\"token\":\"ch_8fEIOajDKz50NcAnhwaGsQ\",\"success\":true,\"amount\":50000,\"currency\":\"AUD\",\"description\":\"Dragon eggs\",\"email\":\"hagrid@hogwarts.wiz\",\"ip_address\":\"127.0.0.1\",\"created_at\":\"2018-05-22T14:50:26Z\",\"status_message\":\"Success\",\"error_message\":null,\"card\":{\"token\":\"card_uZASL3Hx7vVo_ur2BN_MWA\",\"scheme\":\"master\",\"display_number\":\"XXXX-XXXX-XXXX-0000\",\"expiry_month\":12,\"expiry_year\":2020,\"name\":\"Rubius Hagrid\",\"address_line1\":\"The Game Keepers Cottage\",\"address_line2\":null,\"address_city\":\"Hogwarts\",\"address_postcode\":null,\"address_state\":null,\"address_country\":\"England\",\"customer_token\":null,\"primary\":null},\"transfer\":[],\"amount_refunded\":0,\"total_fees\":1530,\"merchant_entitlement\":48470,\"refund_pending\":false,\"authorisation_expired\":false,\"captured\":true,\"settlement_currency\":\"AUD\",\"metadata\":{}}],\"count\":25,\"pagination\":{\"current\":1,\"previous\":null,\"next\":2,\"per_page\":25,\"pages\":6,\"count\":149}}",
      "headers": {
        "Date": "Thu, 24 May 2018 05:02:36 GMT",
        "Content-Type": "application/json; charset=utf-8",
        "Content-Length": "20707",
        "Connection": "keep-alive",
        "Server": "nginx",
        "ETag": "W/\"c98924d8f5033bdd749194df81d51dec\"",
        "Cache-Control": "max-age=0, private, must-revalidate",
        "X-Request-Id": "02b05c8e-3e36-469f-8171-003b75dcf57f",
        "X-Runtime": "0.120144",
        "Strict-Transport-Security": "max-age=252460800; includeSubdomains; preload",
        "X-Content-Type-Options": "nosniff",
        "X-Download-Options": "noopen",
        "X-Frame-Options": "DENY",
        "X-Permitted-Cross-Domain-Policies": "none",
        "X-XSS-Protection": "1; mode=block"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]